In [1]:
#import dependencies
import pandas as pd
from sqlalchemy import create_engine
import numpy as np
import csv
import io
import requests
import pymysql
pymysql.install_as_MySQLdb()
import mysql.connector
import MySQLdb
import json

### Extract CSVs into DataFrames

#### CSV source file from Kaggle with Airline name and IATA Code
##### http://datasets.flowingdata.com/tuts/maparcs/flights.csv

In [2]:
flights = "static/data/flights.csv"
flights_df = pd.read_csv(flights)
flights_df.head()

  airline airport1 airport2  cnt
0      AA      DFW      SJU  120
1      AA      MSP      DFW  326
2      AA      LGA      ORD  860
3      AA      TPA      JFK   56
4      AA      STT      BOS   44

In [3]:
#Cleaning of data
flights_df = flights_df.dropna().reset_index(drop=True)
flights_df.head()

  airline airport1 airport2  cnt
0      AA      DFW      SJU  120
1      AA      MSP      DFW  326
2      AA      LGA      ORD  860
3      AA      TPA      JFK   56
4      AA      STT      BOS   44

### Transform Airlines DataFrame merged together based on common key (IATA Code)

In [4]:
# Create a transformed dataframe with clean data
flights_df = flights_df.rename(columns={"airline": "Airport_Code", "airport1": "Origin", "airport2": "Destination",
                                        "cnt": "Flights_Count"})
flights_df.head()

  Airport_Code Origin Destination  Flights_Count
0           AA    DFW         SJU            120
1           AA    MSP         DFW            326
2           AA    LGA         ORD            860
3           AA    TPA         JFK             56
4           AA    STT         BOS             44

### Create database connection

In [5]:
#Create mysql db connection
connection_string = "root:root@127.0.0.1/FLIGHTS_PROJECT"
engine = create_engine(f'mysql://root:etlproject@127.0.0.1/FLIGHTS_PROJECT')

In [6]:
# Confirm tables -- flights_stats
engine.table_names()

['flights_stats']

### Load DataFrames into database (MySQL)

In [7]:
flights_df.to_sql(name='flights_stats', con=engine, if_exists='append', index=False)

In [8]:
#Reading the data from the us_airlines_stats mysql database
sql = "select * from flights_stats"
output_df = pd.read_sql(sql, engine)

#Display the results
output_df.head()

  Airport_Code Origin Destination  Flights_Count
0           AA    DFW         SJU            120
1           AA    MSP         DFW            326
2           AA    LGA         ORD            860
3           AA    TPA         JFK             56
4           AA    STT         BOS             44

### Select inserted data and dump them into a Json file in the Resources folder

In [9]:
dbconn=MySQLdb.connect(
      database='FLIGHTS_PROJECT', user='root', password='etlproject', host='localhost')

In [10]:
query = 'select * from flights_stats'

In [11]:
with dbconn.cursor(MySQLdb.cursors.DictCursor) as cursor:
    cursor.execute(query)
    data = cursor.fetchall()

In [13]:
#print (json.dumps(data,indent=4))
with open('static/data/flights_data.json', 'w') as outfile:
    json.dump(data, outfile)

In [14]:
output_df2 = output_df[['Origin', 'Destination']].copy()

In [15]:
output_df2 = output_df2.groupby(['Origin']).count().sort_values('Destination', ascending=False).reset_index()
#output_df2.head()

In [16]:
output_df2.to_csv("airlines_grouped.csv", index=False)